# 판다스의 시리즈

In [2]:
import pandas as pd

a_series = pd.Series({'a':10, 'b':20, 'c':30, 'd':40, 'e':30})    # 딕셔너리의 키가 인덱스명, 값이 value로
print(a_series)
print(type(a_series))

a    10
b    20
c    30
d    40
e    30
dtype: int64
<class 'pandas.core.series.Series'>

# 시리즈의 데이터 선택 : 시리즈명[] -> 인덱스명 또는 인덱스 첨자로 찾을 수 있다

In [3]:
print(a_series.index)
print()

print(a_series.values)
print()

print(a_series.value_counts())             # 딕셔너리 안의 같은 값의 갯수를 센다(데이터 분석용)
print()

print(a_series['a'], a_series[0])
print()

print(a_series[[0, 1]])                    # 값이 여러개면 리스트로 넣는다. -> ['a', 'c'], [1, 2]
print()

print(a_series[0:2])                       # 숫자 인덱스 start:end -> end 미포함
print()

print(a_series['a':'c'])                   # 인덱스명 start:end -> end 포함

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

[10 20 30 40 30]

30    2
10    1
20    1
40    1
dtype: int64

10 10

a    10
b    20
dtype: int64

a    10
b    20
dtype: int64

a    10
b    20
c    30
dtype: int64

In [5]:
b_serise = pd.Series([10, 'test', True, 'data'])
b_serise                                               # 인덱스명을 주지 않으면 알아서 인덱스 포함

0      10
1    test
2    True
3    data
dtype: object

In [6]:
c_serise = pd.Series([10, 'test', True, 'data'], index = ['a', 'b', 'c', 'd'])
c_serise                                                # 첨자 인덱스로 인덱스 설정 가능

a      10
b    test
c    True
d    data
dtype: object

In [7]:
d_serise = pd.Series([10, 'test', True, 'data'])
print(d_serise)
print()

d_serise.index = ['a', 'b', 'c', 'd']
print(d_serise)                                         # 이런 식으로도 인덱스를 넣을 수 있다.

0      10
1    test
2    True
3    data
dtype: object

a      10
b    test
c    True
d    data
dtype: object

# 데이터프레임 : 여러개의 시리즈가 모여서 만들어짐
### 딕셔너리의 키 = 칼럼명(시리즈 이름)이 됨

In [8]:
# 데이터프레임 만드는 법 = pandas.DataFrame(딕셔너리, [index = 행이름], [colums = 열이름])

dict_data = {'c0': [1, 2, 3], 'c1' : [4, 5, 6], 'c2' : [7, 8, 9], 'c3' : [10, 11, 12]}

df = pd.DataFrame(dict_data)                     # 데이터프레임 생성
print(df)
print()

print(df.columns, df.index)                      # 컬러명, 인덱스명 검색
print()

df.index = {'a', 'b', 'c'}                       # 새로운 인덱스명 부여
print(df.columns, df.index)    
print()

df.columns = ['a1', 'a2', 'a3', 'a4']             # 새로운 컬럼명 부여
print(df.columns, df.index)    
print()

df

   c0  c1  c2  c3
0   1   4   7  10
1   2   5   8  11
2   3   6   9  12

Index(['c0', 'c1', 'c2', 'c3'], dtype='object') RangeIndex(start=0, stop=3, step=1)

Index(['c0', 'c1', 'c2', 'c3'], dtype='object') Index(['b', 'c', 'a'], dtype='object')

Index(['a1', 'a2', 'a3', 'a4'], dtype='object') Index(['b', 'c', 'a'], dtype='object')

   a1  a2  a3  a4
b   1   4   7  10
c   2   5   8  11
a   3   6   9  12

In [9]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                 index = ['a', 'b', 'c'],
                 columns = ['c1', 'c2', 'c3'])
df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

# 행 인덱스 / 열 이름 지정

In [11]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], 
                   index = ['준서', '예은'], columns = ['나이', '성별', '학교'])
print(df.index, df.columns)

Index(['준서', '예은'], dtype='object') Index(['나이', '성별', '학교'], dtype='object')

In [12]:
# 행 이름 변경 : df.index = [인덱스명, ...]
# 컬럼명 변경 : df.columns = [컬럼명, ...]
# 행 인덱스의 일부 이름 변경 df.rename(index = {기존 인덱스명 : 새로운 인덱스명})
# 컬럼명의 일부 이름 변경 df.rename(cloumns = {기존 컬럼명 : 새로운 컬럼명})

# 준서의 이름을 학생1로 변경

df.rename(index = {'준서' : '학생1'})       # 기존의 데이터를 바꿔서 보여주지만 원본이 바뀌진 않음
# print(df)

     나이 성별   학교
학생1  15  남  덕영중
예은   17  여  수리중

In [13]:
df.rename(index = {'준서' : '학생1'}, inplace = True)       # inplace = True 기존 데이터 변경
print(df)

     나이 성별   학교
학생1  15  남  덕영중
예은   17  여  수리중

In [14]:
df.rename(columns = {'학교' : '학교이름'}, inplace = True)
print(df)

     나이 성별 학교이름
학생1  15  남  덕영중
예은   17  여  수리중

# 데이터프레임 삭제

In [15]:
exam_data = {'수학' : [90, 80, 70], '영어' : [89, 98, 100],
            '음악' : [86, 97, 99], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df)
print()

# 데이터프레임 인덱스명 추가

df.index = ['서준', '우현', '인아']
print(df)

df2 = df.copy()                          # df2 = df -> 주소만 복사되어 기존 데이터 공유
df2

# '우현' 자료 삭제 (행을 삭제)

df2.drop(['우현', '인아'], axis = 0, inplace = True)     # axis = 0 : 행(가로, 인덱스)을 삭제
                                        
    
df2.drop('수학', axis = 1)                              # axis = 1 : 열(세로, 컬럼)을 삭제

   수학   영어  음악   체육
0  90   89  86  100
1  80   98  97   90
2  70  100  99   90

    수학   영어  음악   체육
서준  90   89  86  100
우현  80   98  97   90
인아  70  100  99   90

    영어  음악   체육
서준  89  86  100

In [16]:
exam_data = {'수학' : [90, 80, 70], '영어' : [89, 98, 100],
            '음악' : [86, 97, 99], '체육' : [100, 90, 90]}

df = pd.DataFrame(exam_data)

df2 = df.copy()

# df2의 인덱스는 '서준', '우현', '민아' 추가

df2.index = ['서준', '우현', '민아']
df2

    수학   영어  음악   체육
서준  90   89  86  100
우현  80   98  97   90
민아  70  100  99   90

# 행 선택 -> df.loc[인덱스명], df.iloc[인덱스 첨자]

In [17]:
print(df2.loc['서준'])
print()

df2.iloc[0]

수학     90
영어     89
음악     86
체육    100
Name: 서준, dtype: int64

수학     90
영어     89
음악     86
체육    100
Name: 서준, dtype: int64

In [18]:
# '서준'과 '우현'의 자료 검색 : 인덱스 명으로

print(df2.loc[['서준', '우현']])
print()

print(df2.loc['서준' : '우현'])           # 우현 포함
print()

print(df2.iloc[0, 1])
print()

print(df2.iloc[0 : 1])                    # 1 미포함
print()

# 국어 점수를 100, 80, 90을 df2에 추가

print(df.수학)                            # 컬럼 자료 출력
print()

print(df['수학'])                                
print()

df2['국어'] = [100, 80, 90]               # 컬럼 추가
df2

    수학  영어  음악   체육
서준  90  89  86  100
우현  80  98  97   90

    수학  영어  음악   체육
서준  90  89  86  100
우현  80  98  97   90

89

    수학  영어  음악   체육
서준  90  89  86  100

0    90
1    80
2    70
Name: 수학, dtype: int64

0    90
1    80
2    70
Name: 수학, dtype: int64

    수학   영어  음악   체육   국어
서준  90   89  86  100  100
우현  80   98  97   90   80
민아  70  100  99   90   90

In [19]:
df2

# 음악과 국어 점수 출력
# 서준과 우현의 점수 출력
# 수학, 영어, 음악 점수 출력

print(df2[['음악', '국어']])                         # 컬럼은 그냥
print()

print(df2.loc[['서준', '우현']])                     # 인덱스는 loc, iloc
print()

print(df2[['수학', '영어', '음악']])

    음악   국어
서준  86  100
우현  97   80
민아  99   90

    수학  영어  음악   체육   국어
서준  90  89  86  100  100
우현  80  98  97   90   80

    수학   영어  음악
서준  90   89  86
우현  80   98  97
민아  70  100  99

In [20]:
# 새로운 행 추가 '철수' -> 100, 80, 90, 77, 50
print(df2)
df2.loc['철수'] = [100, 80, 90, 77, 50]
df2

    수학   영어  음악   체육   국어
서준  90   89  86  100  100
우현  80   98  97   90   80
민아  70  100  99   90   90

     수학   영어  음악   체육   국어
서준   90   89  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50

In [21]:
# 각 원소 접근 df.loc[인덱스명, 컬럼명], df.loc[인덱스명][컬럼명]
# df.iloc[인덱스첨자, 컬럼위치 인덱스], df.iloc[인덱스첨자][컬럼위치]

# 서준의 영어 점수 검색

print(df2.loc['서준', '영어'], df2.loc['서준']['영어'])
print()

print(df2.iloc[0, 1], df2.iloc[0][1])
print()

# 서준과 우현의 영어 점수

print(df2.loc[['서준', '우현'], '영어'])
print()

# 서준의 영어 점수를 100점으로 시정
df2.loc['서준', '영어'] = 100
df2
print()

# 서준부터 민아까지의 수학과 영어 점수를 출력

print(df2.loc[['서준', '우현', '민아'], ['수학', '영어']])
df2.loc['서준' : '민아', ['수학', '영어']]                  # 인덱스는 ':' 사용 가능
                                                            # 컬럼은 ':' 사용 불가

89 89

89 89

서준    89
우현    98
Name: 영어, dtype: int64


    수학   영어
서준  90  100
우현  80   98
민아  70  100

    수학   영어
서준  90  100
우현  80   98
민아  70  100

In [22]:
df3 = df.copy()

# 추가 칼럼명 = [이름: 우현, 서준, 민아]

df3['이름'] = ['우현', '서준', '민아']
df3

# 특정 칼럼을 인덱스로 설정
# df.set_index(컬럼명, inplace = True)

df3.set_index('이름', inplace = True)
df3

    수학   영어  음악   체육
이름
우현  90   89  86  100
서준  80   98  97   90
민아  70  100  99   90

In [23]:
# 인덱스 초기화 df.reset_index()

df3.reset_index(inplace = True)
df3

   이름  수학   영어  음악   체육
0  우현  90   89  86  100
1  서준  80   98  97   90
2  민아  70  100  99   90

In [24]:
# 행 인덱스 재배열

df3.set_index('이름', inplace = True)
df3.index

Index(['우현', '서준', '민아'], dtype='object', name='이름')

In [25]:
df4 = df3.reindex(['철수', '우현', '서준', '민아'])
df4

      수학     영어    음악     체육
이름
철수   NaN    NaN   NaN    NaN
우현  90.0   89.0  86.0  100.0
서준  80.0   98.0  97.0   90.0
민아  70.0  100.0  99.0   90.0

# 데이터프레임 : 2차원 배열 (시리즈가 열로 묶인 배열)
### 인덱스 접근 방법 : df.loc[인덱스명], 값이 여러개 [ , ...]
### 컬럼 접근 방법 : df[컬럼명]
### 원소 접근 방법 : df.loc[인덱스명, 컬럼명]
###                            df.iloc[인덱스 첨자, 컬럼 첨자]
### 인덱스 생성 : df.index = [인덱스명, ...]
### 특정 칼럼을 인덱스로 : df.set_index(컬럼명, inplace = True)
### 인덱스 초기화 : df.reset_index(inplace = True)
### 인덱스 재배열 : df.reindex([인덱스명, ...])
### 인덱스 삭제 : df.drop(index = [인덱스명])
### 컬럼 삭제 : df.drop(columns = [컬럼명])
### 인덱스 정렬 : df.sort_index()
### 값으로 정렬 : df.sort_values(by = 컬럼명, ascending = False)

In [28]:
print(df2); print()

print(df2.iloc[0 : 2, 1 : 3])                  # 0행, 1행, 1열 2열
print()

print(df2.iloc[:2, :]); print()

print(df2.iloc[: , :])

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50

     영어  음악
서준  100  86
우현   98  97

    수학   영어  음악   체육   국어
서준  90  100  86  100  100
우현  80   98  97   90   80

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50

In [29]:
# index를 기준으로 정렬 : df.sort_index()

df2.sort_index()

     수학   영어  음악   체육   국어
민아   70  100  99   90   90
서준   90  100  86  100  100
우현   80   98  97   90   80
철수  100   80  90   77   50

In [37]:
# value를 기준으로 정렬 : df.sort_value(by = 컬럼명, ascending = False)

df5 = df2. sort_values(by = ['체육', '국어'], ascending= False)     # 체육이 우선순위
df5

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
민아   70  100  99   90   90
우현   80   98  97   90   80
철수  100   80  90   77   50

In [44]:
df = pd.DataFrame({'a' : [1, 2, 3, 4]}, index = ['C', 'A', 'b', 'd'])
df.sort_index(key = lambda x: x.str.lower(), inplace = True)
print(type(df)); print()

print(type(df.a))

<class 'pandas.core.frame.DataFrame'>

<class 'pandas.core.series.Series'>

In [48]:
df_t = df2.transpose()             # 인덱스와 컬럼 위치 바꾸기
print(df_t); print()

print(df2)
df2

     서준  우현   민아   철수
수학   90  80   70  100
영어  100  98  100   80
음악   86  97   99   90
체육  100  90   90   77
국어  100  80   90   50

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50

In [50]:
df2.reindex(['서준', '우현', '민아', '철수', 'a'], fill_value = 0)

     수학   영어  음악   체육   국어
서준   90  100  86  100  100
우현   80   98  97   90   80
민아   70  100  99   90   90
철수  100   80  90   77   50
a     0    0   0    0    0

In [51]:
import numpy as np

np.nan + 0                            # 계산식에 nan이 있으면 결과는 nan, 즉, nan 데이터를 0 이나
                                      # 빈 공간으로 만들어줘야한다.

nan

# 시리즈 연산 : 시리즈 + 사칙연산 + 숫자

In [53]:
sr = pd.Series({'국어' : 100, '수학' : 90, '영어' : 90})
print(sr); print()

# 각 점수에 100을 더한 값 출력

print(sr+ 100); print()

# 각 점수에 100을 나눈 값 출력

print(sr / 100)

국어    100
수학     90
영어     90
dtype: int64

국어    200
수학    190
영어    190
dtype: int64

국어    1.0
수학    0.9
영어    0.9
dtype: float64

# 시리즈 + 사칙연산 + 시리즈
### NaN 처리 필수!

In [57]:
sr1 = pd.Series({'국어' : 100, '수학' : 90, '영어' : 90, '체육' : 80})
sr2 = pd.Series({'영어' : 100, '국어' : 90, '수학' : 90, '과학' : 90})      # sr1에 과학이 없으므로
                                                                            # 과학은 NaN이 나온다.
print(sr1 + sr2); print()

print(sr1.add(sr2, fill_value = 0))                   # sr1에다가 sr2의 값을 더해라. 대신 nan 값이 
                                                      # 있다면 nan 대신 0을 넣어라.

과학      NaN
국어    190.0
수학    180.0
영어    190.0
체육      NaN
dtype: float64

과학     90.0
국어    190.0
수학    180.0
영어    190.0
체육     80.0
dtype: float64

# 데이터프레임 연산

In [61]:
import seaborn as sns                   # 그래프를 조금 더 예쁘게 만들어주는 import

df = sns.load_dataset('titanic')        # 'age', 'fare' 컬럼만 정보를 가져옴
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [67]:
df = df.loc[: , ['age', 'fare']]

print(df.head())                             # 자료 위에서 5개만 가져오기
print()

print(df.head(3))                            # 자료 위에서 3개만 가져오기
print()

type(df)

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250

pandas.core.frame.DataFrame

In [68]:
(df + 10).head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [74]:
df1 = df.head().copy()
df2 = df.tail().copy()

print(df1); print()
print(df2); print()

df1.reset_index(inplace = True)
df2.reset_index(inplace = True)
print(df1); print()
print(df2)

df1.drop(columns = 'index', axis = 1, inplace = True)
df1

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

   index   age     fare
0      0  22.0   7.2500
1      1  38.0  71.2833
2      2  26.0   7.9250
3      3  35.0  53.1000
4      4  35.0   8.0500

   index   age   fare
0    886  27.0  13.00
1    887  19.0  30.00
2    888   NaN  23.45
3    889  26.0  30.00
4    890  32.0   7.75

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [75]:
df2.drop(columns = 'index', axis = 1, inplace = True)
df2

    age   fare
0  27.0  13.00
1  19.0  30.00
2   NaN  23.45
3  26.0  30.00
4  32.0   7.75

In [76]:
df1 + df2

    age      fare
0  49.0   20.2500
1  57.0  101.2833
2   NaN   31.3750
3  61.0   83.1000
4  67.0   15.8000

In [77]:
# seaborn 에서 제공하는 데이터셋 확인

sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'taxis',
 'tips',
 'titanic']

In [84]:
# seaborn 에서 제공하는 데이터셋을 불러와서 작업
# sns.load_dataset(데이터셋명)

df = sns.load_dataset('iris')
df.head()           # 처음 5개의 데이터 확인 
df.info()           # 데이터프레임의 구조 확인, 각 컬럼의 자료 타입, 데이터의 총 갯수    
df.tail()           # 마지막 5개의 데이터 확인
df.describe()       # 간단한 통계정보 확인
df.columns
df.index

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

RangeIndex(start=0, stop=150, step=1)

In [90]:
# mpg 데이터셋을 불러와서 처음 5개의 데이터 확인
# mpg의 컬럼명 확인
# mpg에서 int인 컬럼만 10번째 부터 100번째까지의 자료 추출

df_mpg = sns.load_dataset('mpg')

df_mpg.head()
df_mpg.info()
df_mpg.columns
df_mpg.loc[10 : 101, ['cylinders', 'weight', 'model_year']]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

     cylinders  weight  model_year
10           8    3563          70
11           8    3609          70
12           8    3761          70
13           8    3086          70
14           4    2372          70
..         ...     ...         ...
97           6    3121          73
98           6    3278          73
99           6    2945          73
100          6    3021          73
101          6    2904          73

[92 rows x 3 columns]

# df에서 데이터 타입이 int64 인 컬럼명 검색

In [97]:
column = list(df_mpg.columns)

print(column); print()                 # 컬럼의 데이터 타입이 int64 인 컬럼만 검색

print(df_mpg['mpg'].dtype)

int_column = [x for x in column if df_mpg[x].dtype == 'int64']

df_mpg.loc[10 : 100, int_column]                         # 원하는 인덱스와 컬럼만 검색

['mpg', 'cylinders', 'displacement', 'horsepower', 'weight', 'acceleration', 'model_year', 'origin', 'name']

float64

     cylinders  weight  model_year
10           8    3563          70
11           8    3609          70
12           8    3761          70
13           8    3086          70
14           4    2372          70
..         ...     ...         ...
96           8    3821          73
97           6    3121          73
98           6    3278          73
99           6    2945          73
100          6    3021          73

[91 rows x 3 columns]